app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
AND `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
AND `role` = 'teacher'
AND `role` = 'student'
---
    public function dashboard()
    {
        $session = session();

        // Check if user is logged in
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        // Check if user has admin role
        if ($session->get('userRole') !== 'admin') {
            return redirect()->to(base_url('login'))->with('error', 'Access denied. Admin privileges required.');
        }

        // Get user model to fetch statistics
        $userModel = new \App\Models\UserModel();
        $courseModel = new \App\Models\CourseModel();

        // Get total users count
        $totalUsers = $userModel->countAllResults();

        // Get total courses count
        $courseCount = $courseModel->countAllResults();

        // Get users by role
        $adminCount = $userModel->where('role', 'admin')->countAllResults(false);
        $teacherCount = $userModel->where('role', 'teacher')->countAllResults(false);
        $studentCount = $userModel->where('role', 'student')->countAllResults(false);

        // Get total courses count
        $courseCount = $courseModel->countAllResults();

SELECT *
FROM `users`
WHERE `role` = 'admin'
AND `role` = 'teacher'
AND `role` = 'student'
ORDER BY `created_at` DESC
---
        // Get recent users
        $recentUsers = $userModel->orderBy('created_at', 'DESC')->findAll();

        $data = [
            'title' => 'Admin Dashboard',
            'totalUsers' => $totalUsers,
            'adminCount' => $adminCount,
            'teacherCount' => $teacherCount,
            'studentCount' => $studentCount,
            'courseCount'  => $courseCount,
            'recentUsers' => $recentUsers,
            'userRole' => $session->get('userRole'),
            'userEmail' => $session->get('userEmail')
        ];